Repository: uburuntu/derp
Catalog: derp/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: 👋 Hello, {name}! I'm Derp, your AI-powered Telegram assistant powered by Google's Gemini. I can help you with: • 🤖 AI conversations and questions • 🎨 Image generation and editing (premium) • 📝 Code generation and analysis • 🔍 Web search and research • 💭 Chat memory management Type /help to see all available commands, or just start chatting with me!
ru: 👋 Привет, {name}! Я Derp, ваш ИИ-помощник в Telegram, работающий на Google Gemini. Я могу помочь вам с: • 🤖 ИИ-разговорами и вопросами • 🎨 Генерацией и редактированием изображений (премиум) • 📝 Генерацией и анализом кода • 🔍 Поиском в интернете и исследованиями • 💭 Управлением памятью чата Введите /help, чтобы увидеть все доступные команды, или просто начните со мной общаться!

source: I'm a friendly AI-powered Telegram bot Available commands: • /derp - Trigger AI response • /donate [stars] - Support the bot with Telegram Stars (default 20) • /credits - Check your credit balance • /buy - Purchase personal credits with Stars • /buy_chat - Purchase chat pool credits (groups) • /imagine <prompt> - Generate images with AI (premium) • /edit <prompt> - Edit images with AI (premium) • /video [fast|standard] <prompt> - Generate a video with Veo (premium) • /tts <text> - Generate a voice message (premium) • /settings - Show current chat settings • /set_memory <text> - Set LLM memory for this chat • /clear_memory - Clear LLM memory for this chat • /help - Show this help message You can also: • Mention me (@DerpRobot) in group chats • Reply to my messages • Use me in private chats • Use inline mode: @DerpRobot <query>
ru: Я дружелюбный бот, работающий на искусственном интеллекте Доступные команды: • /derp - Запустить ИИ-ответ • /donate [звёзды] - Поддержать бота Telegram Stars (по умолчанию 20) • /credits - Показать баланс кредитов • /buy - Купить личные кредиты за Stars • /buy_chat - Купить кредиты для общего пула чата (группы) • /imagine <запрос> - Сгенерировать изображение (премиум) • /edit <запрос> - Отредактировать изображение (премиум) • /video [fast|standard] <запрос> - Сгенерировать видео Veo (премиум) • /tts <текст> - Сгенерировать голосовое сообщение (премиум) • /settings - Показать текущие настройки чата • /set_memory <текст> - Установить память ИИ для чата • /clear_memory - Очистить память ИИ для чата • /help - Показать это сообщение помощи Вы также можете: • Упомянуть меня (@DerpRobot) в групповых чатах • Ответить на мои сообщения • Использовать меня в личных чатах • Использовать инлайн-режим: @DerpRobot <запрос>

source: 🛠 Debug (admin only): • /debug_buy - 1⭐ test packs (user/chat) • /debug_credits <n> [chat] - Add credits • /debug_reset [chat] - Reset to 0 • /debug_status - Full diagnostic • /debug_refund <id> - Test refund • /debug_tools - List tool pricing • /debug_help - All debug commands
ru: 🛠 Отладка (только для админа): • /debug_buy - тестовые пакеты за 1⭐ (личные/чат) • /debug_credits <n> [chat] - добавить кредиты • /debug_reset [chat] - сбросить в 0 • /debug_status - полная диагностика • /debug_refund <id> - тест возврата • /debug_tools - цены инструментов • /debug_help - все отладочные команды

source: Context: {chars} chars, {msgs} messages
ru: Контекст: {chars} символов, {msgs} сообщений

source: 😅 Something went wrong. I couldn't process that message.
ru: 😅 Что-то пошло не так. Я не смог обработать это сообщение.

source: ⏳ I'm getting too many requests right now. Please try again in about 30 seconds.
ru: ⏳ Сейчас слишком много запросов. Пожалуйста, попробуйте снова примерно через 30 секунд.

source: 😅 Could not find your user info.
ru: 😅 Не удалось найти информацию о вашем пользователе.

source: 💰 **Your Credits**
ru: 💰 **Ваши кредиты**

source: 🏠 Chat pool: **{credits}** credits
ru: 🏠 Общий пул чата: **{credits}** кредитов

source: 👤 Personal: **{credits}** credits
ru: 👤 Личные: **{credits}** кредитов

source: ✅ Chat credits will be used first.
ru: ✅ Сначала будут использованы кредиты чата.

source: ✅ Your personal credits will be used.
ru: ✅ Будут использованы ваши личные кредиты.

source: 💡 No credits! Use /buy to get some.
ru: 💡 Нет кредитов! Используйте /buy, чтобы купить.

source: 👤 Balance: **{credits}** credits
ru: 👤 Баланс: **{credits}** кредитов

source: ✅ You have credits for premium features!
ru: ✅ У вас есть кредиты для премиум-функций!

source: 🛒 **Credit Packs**
ru: 🛒 **Пакеты кредитов**

source: Buy credits with Telegram Stars ⭐
ru: Купить кредиты за Telegram Stars ⭐

source: • **{name}**: {stars} ⭐ → {credits} credits (+{bonus}% bonus)
ru: • **{name}**: {stars} ⭐ → {credits} кредитов (+{bonus}% бонус)

source: • **{name}**: {stars} ⭐ → {credits} credits
ru: • **{name}**: {stars} ⭐ → {credits} кредитов

source: **What can you do with credits?**
ru: **На что можно потратить кредиты?**

source: • 1 credit = 1 AI message (better quality model)
ru: • 1 кредит = 1 сообщение ИИ (модель получше)

source: • 5 credits = 1 image generation
ru: • 5 кредитов = 1 генерация изображения

source: • 10 credits = 1 deep thinking (/think)
ru: • 10 кредитов = 1 глубокое размышление (/think)

source: 👇 **Tap a button to buy:**
ru: 👇 **Нажмите кнопку, чтобы купить:**

source: 💡 This command is for group chats only. Use /buy for personal credits.
ru: 💡 Эта команда работает только в групповых чатах. Используйте /buy для личных кредитов.

source: 🏠 **Buy Chat Credits**
ru: 🏠 **Купить кредиты для чата**

source: Credits for this chat's shared pool.
ru: Кредиты для общего пула этого чата.

source: Everyone in the chat can use them!
ru: Их смогут использовать все участники!

source: 🛠 **Debug Buy Menu** All packs cost 1⭐ for testing. Choose user or chat credits:
ru: 🛠 **Меню тестовой покупки** Все пакеты стоят 1⭐ для тестирования. Выберите личные или чат-кредиты:

source: 🛠 **Debug Commands** (admin only) **Payment Testing:** • /debug_buy - Buy credits with 1⭐ test packs • /debug_credits <n> [chat] - Add credits directly • /debug_reset [chat] - Reset credits to 0 • /debug_refund <charge_id> - Test refund flow **Diagnostics:** • /debug_status - Show tier, balances, model config • /debug_tools - List tools with pricing • /debug_help - This help message
ru: 🛠 **Отладочные команды** (только для админа) **Тестирование оплат:** • /debug_buy - купить кредиты тестовыми пакетами за 1⭐ • /debug_credits <n> [chat] - добавить кредиты напрямую • /debug_reset [chat] - сбросить кредиты в 0 • /debug_refund <charge_id> - протестировать возврат **Диагностика:** • /debug_status - показать tier, балансы, конфиг моделей • /debug_tools - показать цены инструментов • /debug_help - это сообщение

source: keep Derp caffeinated
ru: напоить Derp кофе

source: pay the server bills
ru: оплатить серверы

source: speed up image magic
ru: ускорить магию изображений

source: train the tiny gremlins
ru: обучить маленьких гремлинов

source: fuel new features
ru: подпитать новые фичи

source: keep logs tidy and shiny
ru: держать логи в чистоте и блеске

source: bribe the RNG for better rolls
ru: задобрить RNG для лучших роллов

source: teach Derp a new trick
ru: научить Derp новой хитрости

source: banish heisenbugs into the void
ru: изгнать гейзенбагов в пустоту

source: keep the hamster wheel spinning
ru: крутить хомячье колесо

source: Support Derp
ru: Поддержать Derp

source: Power Up Derp
ru: Прокачать Derp

source: Boost Derp
ru: Ускорить Derp

source: Derp Fuel
ru: Топливо для Derp

source: Derp Snacks
ru: Перекус для Derp

source: Shiny Upgrades
ru: Блестящие апгрейды

source: Coffee Run
ru: Забег за кофе

source: Server Snacks
ru: Перекус для серверов

source: Feature Juice
ru: Сок фич

source: Good Vibes
ru: Добрые вайбы

source: Bug Zapper
ru: Уничтожитель багов

source: Gremlin School
ru: Школа гремлинов

source: Every star helps {purpose}.
ru: Каждая звезда помогает {purpose}.

source: Your stars directly help us {purpose}.
ru: Ваши звёзды напрямую помогают {purpose}.

source: Tiny bit of stardust to {purpose}.
ru: Немного звёздной пыли, чтобы {purpose}.

source: Stars today, fewer bugs tomorrow — {purpose}.
ru: Звёзды сегодня — меньше багов завтра — {purpose}.

source: A sprinkle of ✨ to {purpose}.
ru: Щепотка ✨ чтобы {purpose}.

source: You rock.
ru: Ты классный.

source: Thank you for being awesome!
ru: Спасибо, что ты классный!

source: High‑five from the team ✋
ru: Дай пять от команды ✋

source: We'll spend it wisely.
ru: Потратим с умом.

source: Much love from Derp HQ 💙
ru: Любовь из штаба Derp 💙

source: Deploying instant good karma…
ru: Отправляем мгновенную карму…

source: Donation
ru: Пожертвование

source: Use /donate {n} to donate {n}⭐️.
ru: Используйте /donate {n}, чтобы задонатить {n}⭐️.

source: friend
ru: друг

source: 🙏 Thank you, {name}, for donating {stars}⭐️! Here's a {kind} for you.
ru: 🙏 Спасибо, {name}, за донат {stars}⭐️! Лови {kind}.

source: You absolute legend, {name}! {stars}⭐️ delivered. {kind} unlocked.
ru: Ты легенда, {name}! {stars}⭐️ доставлены. {kind} разблокирован.

source: {name}, you fed the Derp! +{stars}⭐️ {kind} time.
ru: {name}, ты накормил Derp! +{stars}⭐️ время для {kind}.

source: {stars}⭐️ received — karma++ for {name}! Enjoy a {kind}.
ru: {stars}⭐️ получены — карма++ для {name}! Лови {kind}.

source: {name}, your {stars}⭐️ keeps the servers toasty. {kind} incoming!
ru: {name}, твои {stars}⭐️ держат серверы в тепле. {kind} уже тут!

source: 🙏 Thank you, {name}, for donating {stars}⭐️ to support Derp!
ru: 🙏 Спасибо, {name}, за донат {stars}⭐️ в поддержку Derp!

source: 🤷 No image generated.
ru: 🤷 Изображение не сгенерировано.

source: 🤷 No images generated.
ru: 🤷 Изображения не сгенерированы.

source: Usage: /imagine <prompt>
ru: Использование: /imagine <запрос>

source: 😅 Could not verify your access. Please try again.
ru: 😅 Не удалось проверить доступ. Попробуйте ещё раз.

source: ✨ {reason} 💡 Use /buy to get credits for unlimited image generation!
ru: ✨ {reason} 💡 Используйте /buy, чтобы купить кредиты и генерировать изображения без ограничений!

source: 😅 Something went wrong while generating the image. Try again later.
ru: 😅 Что-то пошло не так при генерации изображения. Попробуйте позже.

source: Reply to an image and use: /edit <prompt>
ru: Ответьте на изображение и используйте: /edit <запрос>

source: Please reply to an image (photo/document/sticker) to edit it.
ru: Пожалуйста, ответьте на изображение (фото/документ/стикер), чтобы его отредактировать.

source: ✨ {reason} 💡 Use /buy to get credits for unlimited image editing!
ru: ✨ {reason} 💡 Используйте /buy, чтобы купить кредиты и редактировать изображения без ограничений!

source: 😅 Something went wrong while editing the image. Try again later.
ru: 😅 Что-то пошло не так при редактировании изображения. Попробуйте позже.

source: 🤖 Ask Derp
ru: 🤖 Спросить Derp

source: Start typing to get an AI-powered response.
ru: Начните печатать, чтобы получить ответ от ИИ.

source: 🤖 Please enter a prompt for Derp AI.
ru: 🤖 Пожалуйста, введите запрос для Derp AI.

source: Add Derp to your chat
ru: Добавить Derp в ваш чат

source: Get an AI-powered response for: {user_input}
ru: Получить ответ от ИИ на: {user_input}

source: 🧠 Thinking about: {user_input}
ru: 🧠 Думаю над: {user_input}

source: Start personal chat
ru: Начать личный чат

source: 🤯 My circuits are a bit tangled. I couldn't generate a response.
ru: 🤯 Мои схемы немного запутались. Не могу сгенерировать ответ.

source: 😅 Something went wrong. I couldn't process that.
ru: 😅 Что-то пошло не так. Не удалось это обработать.

source: Invalid purchase request
ru: Неверный запрос на покупку

source: Unknown credit pack
ru: Неизвестный пакет кредитов

source: {credits} credits for this chat
ru: {credits} кредитов для этого чата

source: {credits} credits for your account
ru: {credits} кредитов для вашего аккаунта

source: {name} Credit Pack
ru: Пакет кредитов «{name}»

source: Credits
ru: Кредиты

source: 💫 Click below to complete your purchase: {link}
ru: 💫 Нажмите ниже, чтобы завершить покупку: {link}

source: Failed to create invoice. Try again.
ru: Не удалось создать счёт. Попробуйте ещё раз.

source: Invalid payment data
ru: Некорректные данные платежа

source: Payment received but credits could not be added. Contact support.
ru: Платёж получен, но кредиты не удалось начислить. Свяжитесь с поддержкой.

source: Payment received but your account was not found. Contact support.
ru: Платёж получен, но ваш аккаунт не найден. Свяжитесь с поддержкой.

source: ✅ **Payment successful!** Added **{credits}** credits to this chat. New balance: **{balance}** credits
ru: ✅ **Платёж успешен!** Начислено **{credits}** кредитов этому чату. Новый баланс: **{balance}** кредитов

source: ✅ **Payment successful!** Added **{credits}** credits to your account. New balance: **{balance}** credits
ru: ✅ **Платёж успешен!** Начислено **{credits}** кредитов на ваш аккаунт. Новый баланс: **{balance}** кредитов

source: Payment received but an error occurred. Contact support with charge ID: {charge_id}
ru: Платёж получен, но произошла ошибка. Свяжитесь с поддержкой и укажите ID платежа: {charge_id}

source: 🧠 **Deep Thinking Mode** Use Gemini 3 Pro for complex math, logic puzzles, or problems that need careful analysis. Usage: /think <your problem or question>
ru: 🧠 **Режим глубокого размышления** Используйте Gemini 3 Pro для сложной математики, логических задач или вопросов, требующих внимательного анализа. Использование: /think <ваша задача или вопрос>

source: 🧠 Deep thinking requires credits. ✨ {reason} 💡 Use /buy to get credits!
ru: 🧠 Для глубокого размышления нужны кредиты. ✨ {reason} 💡 Используйте /buy, чтобы купить кредиты!

source: 😅 Something went wrong during deep thinking. Please try again.
ru: 😅 Что-то пошло не так во время глубокого размышления. Попробуйте ещё раз.

source: Usage: /tts <text>
ru: Использование: /tts <текст>

source: 🔊 Voice generation requires credits. ✨ {reason} 💡 Use /buy to get credits!
ru: 🔊 Для генерации голоса нужны кредиты. ✨ {reason} 💡 Используйте /buy, чтобы купить кредиты!

source: 😅 Something went wrong while generating the voice message. Try again later.
ru: 😅 Что-то пошло не так при генерации голосового сообщения. Попробуйте позже.

source: Usage: /video [fast|standard] <prompt>
ru: Использование: /video [fast|standard] <запрос>

source: 🎬 Video generation requires credits. ✨ {reason} 💡 Use /buy to get credits!
ru: 🎬 Для генерации видео нужны кредиты. ✨ {reason} 💡 Используйте /buy, чтобы купить кредиты!

source: 😅 Something went wrong while generating the video. Try again later.
ru: 😅 Что-то пошло не так при генерации видео. Попробуйте позже.

source: Generated Code:
ru: Сгенерированный код:

source: Execution Result:
ru: Результат выполнения:

source: 📊 Generated images, but couldn't display them.
ru: 📊 Изображения сгенерированы, но не удалось их показать.
